var bankData = [
    {
        "value": "debit_card",
        "text": "借记卡",
        "children": [
            {
                "value": 621098,
                "text": "邮政储蓄银行"
            },
            {
                "value": 510529,
                "text": "中国工商银行"
            },
            {
                "value": 103,
                "text": "农业银行"
            },
            {
                "value": 620501,
                "text": "宁波市农业银行"
            },
            {
                "value": 621660,
                "text": "中国银行"
            },
            {
                "value": 621284,
                "text": "建设银行"
            },
            {
                "value": 621673,
                "text": "中国建设银行"
            },
            {
                "value": "00405512",
                "text": "交通银行"
            },
            {
                "value": 433670,
                "text": "中信银行"
            },
            {
                "value": 303,
                "text": "光大银行"
            },
            {
                "value": 999999,
                "text": "华夏银行"
            },
            {
                "value": 622615,
                "text": "民生银行"
            },
            {
                "value": 622568,
                "text": "广发银行"
            },
            {
                "value": 412963,
                "text": "平安银行"
            },
            {
                "value": 402658,
                "text": "招商银行"
            },
            {
                "value": 90592,
                "text": "兴业银行"
            },
            {
                "value": 622516,
                "text": "浦东发展银行"
            },
            {
                "value": 623078,
                "text": "恒丰银行"
            },
            {
                "value": 6091201,
                "text": "天津市商业银行"
            },
            {
                "value": 940008,
                "text": "齐鲁银行"
            },
            {
                "value": 622886,
                "text": "烟台商业银行"
            },
            {
                "value": 622391,
                "text": "潍坊银行"
            },
            {
                "value": 622359,
                "text": "临沂商业银行"
            },
            {
                "value": 622857,
                "text": "日照市商业银行"
            },
            {
                "value": 621019,
                "text": "浙商银行"
            },
            {
                "value": 621268,
                "text": "渤海银行"
            },
            {
                "value": 621062,
                "text": "花旗银行"
            },
            {
                "value": 622933,
                "text": "东亚银行"
            },
            {
                "value": 622942,
                "text": "渣打银行"
            },
            {
                "value": 621016,
                "text": "星展银行"
            },
            {
                "value": 622950,
                "text": "恒生银行"
            },
            {
                "value": 621060,
                "text": "友利银行"
            },
            {
                "value": 621072,
                "text": "新韩银行"
            },
            {
                "value": 621201,
                "text": "韩亚银行"
            },
            {
                "value": 621077,
                "text": "华侨银行"
            },
            {
                "value": 621298,
                "text": "永亨银行"
            },
            {
                "value": 621213,
                "text": "南洋商业银行"
            },
            {
                "value": 621245,
                "text": "法国兴业银行"
            },
            {
                "value": 621328,
                "text": "大华银行"
            },
            {
                "value": 621277,
                "text": "大新银行"
            },
            {
                "value": 621651,
                "text": "企业银行"
            },
            {
                "value": 623183,
                "text": "上海银行"
            },
            {
                "value": 622393,
                "text": "厦门银行"
            },
            {
                "value": 421317,
                "text": "北京银行"
            },
            {
                "value": 622388,
                "text": "福建海峡银行"
            },
            {
                "value": 622865,
                "text": "吉林银行"
            },
            {
                "value": 622394,
                "text": "镇江市商业银行"
            },
            {
                "value": 621279,
                "text": "宁波银行"
            },
            {
                "value": 622338,
                "text": "焦作市商业银行"
            },
            {
                "value": 621977,
                "text": "温州银行"
            },
            {
                "value": 603445,
                "text": "广州银行"
            },
            {
                "value": 990027,
                "text": "汉口银行"
            },
            {
                "value": 622475,
                "text": "龙江银行"
            },
            {
                "value": 621244,
                "text": "盛京银行"
            },
            {
                "value": 622420,
                "text": "洛阳银行"
            },
            {
                "value": 622399,
                "text": "辽阳银行"
            },
            {
                "value": 603708,
                "text": "大连银行"
            },
            {
                "value": 603506,
                "text": "苏州市商业银行"
            },
            {
                "value": 622498,
                "text": "河北银行"
            },
            {
                "value": 603367,
                "text": "杭州商业银行"
            },
            {
                "value": 621259,
                "text": "南京银行"
            },
            {
                "value": 622333,
                "text": "东莞市商业银行"
            },
            {
                "value": 940051,
                "text": "金华银行"
            },
            {
                "value": 621751,
                "text": "乌鲁木齐市商业银行"
            },
            {
                "value": 622486,
                "text": "绍兴银行"
            },
            {
                "value": 621532,
                "text": "成都商业银行"
            },
            {
                "value": 622442,
                "text": "抚顺银行"
            },
            {
                "value": 623007,
                "text": "临商银行"
            },
            {
                "value": 940055,
                "text": "宜昌市商业银行"
            },
            {
                "value": 622398,
                "text": "葫芦岛市商业银行"
            },
            {
                "value": 622421,
                "text": "郑州银行"
            },
            {
                "value": 621529,
                "text": "宁夏银行"
            },
            {
                "value": 622363,
                "text": "珠海华润银行"
            },
            {
                "value": 940057,
                "text": "齐商银行"
            },
            {
                "value": 622990,
                "text": "锦州银行"
            },
            {
                "value": 622877,
                "text": "徽商银行"
            },
            {
                "value": 9896,
                "text": "重庆银行"
            },
            {
                "value": 940049,
                "text": "哈尔滨银行"
            },
            {
                "value": 622133,
                "text": "贵阳银行"
            },
            {
                "value": 622136,
                "text": "西安银行"
            },
            {
                "value": 60326500,
                "text": "无锡市商业银行"
            },
            {
                "value": 622415,
                "text": "丹东银行"
            },
            {
                "value": 622139,
                "text": "兰州银行"
            },
            {
                "value": 940006,
                "text": "南昌银行"
            },
            {
                "value": 621216,
                "text": "晋商银行"
            },
            {
                "value": 621252,
                "text": "青岛银行"
            },
            {
                "value": 69580,
                "text": "南通商业银行"
            },
            {
                "value": 622162,
                "text": "九江银行"
            },
            {
                "value": 623077,
                "text": "日照银行"
            },
            {
                "value": 622413,
                "text": "鞍山银行"
            },
            {
                "value": 621237,
                "text": "秦皇岛银行"
            },
            {
                "value": 622310,
                "text": "青海银行"
            },
            {
                "value": 622427,
                "text": "台州银行"
            },
            {
                "value": 694301,
                "text": "长沙银行"
            },
            {
                "value": 622967,
                "text": "赣州银行"
            },
            {
                "value": 622370,
                "text": "泉州银行"
            },
            {
                "value": 622400,
                "text": "营口银行"
            },
            {
                "value": 990871,
                "text": "昆明商业银行"
            },
            {
                "value": 622126,
                "text": "阜新银行"
            },
            {
                "value": 622132,
                "text": "嘉兴银行"
            },
            {
                "value": 621340,
                "text": "廊坊银行"
            },
            {
                "value": 622141,
                "text": "泰隆城市信用社"
            },
            {
                "value": 622147,
                "text": "内蒙古银行"
            },
            {
                "value": 622301,
                "text": "湖州市商业银行"
            },
            {
                "value": 621266,
                "text": "沧州银行"
            },
            {
                "value": 622335,
                "text": "南宁市商业银行"
            },
            {
                "value": 622336,
                "text": "包商银行"
            },
            {
                "value": 622337,
                "text": "连云港市商业银行"
            },
            {
                "value": 622411,
                "text": "威海商业银行"
            },
            {
                "value": 623102,
                "text": "威海市商业银行"
            },
            {
                "value": 622342,
                "text": "攀枝花市商业银行"
            },
            {
                "value": 622367,
                "text": "绵阳市商业银行"
            },
            {
                "value": 622392,
                "text": "泸州市商业银行"
            },
            {
                "value": 622395,
                "text": "大同市商业银行"
            },
            {
                "value": 622441,
                "text": "三门峡银行"
            },
            {
                "value": 622448,
                "text": "广东南粤银行"
            },
            {
                "value": 622982,
                "text": "张家口市商业银行"
            },
            {
                "value": 622856,
                "text": "桂林市商业银行"
            },
            {
                "value": 622870,
                "text": "江苏长江商业银行"
            },
            {
                "value": 622866,
                "text": "徐州市商业银行"
            },
            {
                "value": 622292,
                "text": "柳州银行"
            },
            {
                "value": 623072,
                "text": "南充市商业银行"
            },
            {
                "value": 622864,
                "text": "莱芜银行"
            },
            {
                "value": 621403,
                "text": "莱商银行"
            },
            {
                "value": 622561,
                "text": "德阳银行"
            },
            {
                "value": 622167,
                "text": "唐山市商业银行"
            },
            {
                "value": 622777,
                "text": "曲靖市商业银行"
            },
            {
                "value": 622532,
                "text": "晋城银行"
            },
            {
                "value": 621076,
                "text": "江苏银行"
            },
            {
                "value": 622962,
                "text": "长治市商业银行"
            },
            {
                "value": 622936,
                "text": "承德市商业银行"
            },
            {
                "value": 623060,
                "text": "承德银行"
            },
            {
                "value": 622937,
                "text": "德州银行"
            },
            {
                "value": 621460,
                "text": "遵义市商业银行"
            },
            {
                "value": 622960,
                "text": "邯郸市商业银行"
            },
            {
                "value": 621591,
                "text": "安顺市商业银行"
            },
            {
                "value": 621010,
                "text": "平凉市商业银行"
            },
            {
                "value": 622980,
                "text": "玉溪市商业银行"
            },
            {
                "value": 621726,
                "text": "浙江民泰商业银行"
            },
            {
                "value": 621014,
                "text": "上饶市商业银行"
            },
            {
                "value": 621004,
                "text": "东营银行"
            },
            {
                "value": 622972,
                "text": "泰安市商业银行"
            },
            {
                "value": 621028,
                "text": "浙江稠州商业银行"
            },
            {
                "value": 622973,
                "text": "乌海银行"
            },
            {
                "value": 623121,
                "text": "自贡市商业银行"
            },
            {
                "value": 622978,
                "text": "鄂尔多斯银行"
            },
            {
                "value": 622979,
                "text": "鹤壁银行"
            },
            {
                "value": 621035,
                "text": "许昌银行"
            },
            {
                "value": 621200,
                "text": "济宁银行"
            },
            {
                "value": 621038,
                "text": "铁岭银行"
            },
            {
                "value": 621086,
                "text": "乐山市商业银行"
            },
            {
                "value": 621296,
                "text": "长安银行"
            },
            {
                "value": 622945,
                "text": "重庆三峡银行"
            },
            {
                "value": 622940,
                "text": "石嘴山银行"
            },
            {
                "value": 621089,
                "text": "盘锦市商业银行"
            },
            {
                "value": 621029,
                "text": "昆仑银行"
            },
            {
                "value": 621071,
                "text": "平顶山银行"
            },
            {
                "value": 621074,
                "text": "朝阳银行"
            },
            {
                "value": 621345,
                "text": "宁波东海银行"
            },
            {
                "value": 621090,
                "text": "遂宁市商业银行"
            },
            {
                "value": 623178,
                "text": "遂宁是商业银行"
            },
            {
                "value": 621091,
                "text": "保定银行"
            },
            {
                "value": 621238,
                "text": "邢台银行"
            },
            {
                "value": 621057,
                "text": "凉山州商业银行"
            },
            {
                "value": 621075,
                "text": "漯河银行"
            },
            {
                "value": 621233,
                "text": "达州市商业银行"
            },
            {
                "value": 621235,
                "text": "新乡市商业银行"
            },
            {
                "value": 621223,
                "text": "晋中银行"
            },
            {
                "value": 621221,
                "text": "驻马店银行"
            },
            {
                "value": 621239,
                "text": "衡水银行"
            },
            {
                "value": 621271,
                "text": "周口银行"
            },
            {
                "value": 621272,
                "text": "阳泉市商业银行"
            },
            {
                "value": 621273,
                "text": "宜宾市商业银行"
            },
            {
                "value": 621263,
                "text": "库尔勒市商业银行"
            },
            {
                "value": 621325,
                "text": "雅安市商业银行"
            },
            {
                "value": 621327,
                "text": "安阳银行"
            },
            {
                "value": 621753,
                "text": "信阳银行"
            },
            {
                "value": 621366,
                "text": "华融湘江银行"
            },
            {
                "value": 621348,
                "text": "营口沿海银行"
            },
            {
                "value": 621359,
                "text": "景德镇商业银行"
            },
            {
                "value": 621360,
                "text": "哈密市商业银行"
            },
            {
                "value": 621217,
                "text": "湖北银行"
            },
            {
                "value": 621391,
                "text": "西藏银行"
            },
            {
                "value": 621339,
                "text": "新疆汇和银行"
            },
            {
                "value": 621469,
                "text": "广东华兴银行"
            },
            {
                "value": 621601,
                "text": "濮阳银行"
            },
            {
                "value": 621655,
                "text": "宁波通商银行"
            },
            {
                "value": 621636,
                "text": "甘肃银行"
            },
            {
                "value": 623087,
                "text": "枣庄银行"
            },
            {
                "value": 621696,
                "text": "本溪市商业银行"
            },
            {
                "value": 622478,
                "text": "上海农商银行"
            },
            {
                "value": 622323,
                "text": "常熟农村商业银行"
            },
            {
                "value": 622128,
                "text": "深圳农村商业银行"
            },
            {
                "value": 909810,
                "text": "广州农村商业银行"
            },
            {
                "value": 622271,
                "text": "广东南海农村商业银行"
            },
            {
                "value": 940038,
                "text": "佛山顺德农村商业银行"
            },
            {
                "value": 622341,
                "text": "江阴农村商业银行"
            },
            {
                "value": 622867,
                "text": "重庆农村商业银行"
            },
            {
                "value": 621521,
                "text": "山东省农村信用社"
            },
            {
                "value": 622328,
                "text": "东莞农村商业银行"
            },
            {
                "value": 622332,
                "text": "张家港农村商业银行"
            },
            {
                "value": 622127,
                "text": "福建省农村信用社"
            },
            {
                "value": 622138,
                "text": "北京农村商业银行"
            },
            {
                "value": 622531,
                "text": "天津农村商业银行"
            },
            {
                "value": 622339,
                "text": "鄞州农村合作银行"
            },
            {
                "value": 620500,
                "text": "宁波鄞州农村合作银行"
            },
            {
                "value": 621516,
                "text": "成都农村商业银行"
            },
            {
                "value": 621578,
                "text": "江苏省农村信用社"
            },
            {
                "value": 622858,
                "text": "浙江省农村信用社"
            },
            {
                "value": 622855,
                "text": "苏州银行"
            },
            {
                "value": 622859,
                "text": "珠海农村商业银行"
            },
            {
                "value": 622869,
                "text": "太仓农村商业银行"
            },
            {
                "value": 622893,
                "text": "贵州省农村信用社"
            },
            {
                "value": 622895,
                "text": "无锡农村商业银行"
            },
            {
                "value": 622169,
                "text": "湖南省农村信用社"
            },
            {
                "value": 622991,
                "text": "河南省农村信用社"
            },
            {
                "value": 621021,
                "text": "河北省农村信用社"
            },
            {
                "value": 622506,
                "text": "陕西省农村信用社"
            },
            {
                "value": 622992,
                "text": "广西农村信用社"
            },
            {
                "value": 621008,
                "text": "新疆维吾尔自治区农村信用社"
            },
            {
                "value": 621525,
                "text": "新疆农村信用社"
            },
            {
                "value": 623181,
                "text": "吉林省农村信用社"
            },
            {
                "value": 622947,
                "text": "黄河农村商业银行"
            },
            {
                "value": 621526,
                "text": "安徽省农村信用社"
            },
            {
                "value": 621536,
                "text": "海南省农村信用社"
            },
            {
                "value": 621517,
                "text": "青海省农村信用社"
            },
            {
                "value": 622477,
                "text": "广东省农村信用社"
            },
            {
                "value": 622976,
                "text": "内蒙古自治区农村信用社"
            },
            {
                "value": 621033,
                "text": "四川省农村信用社"
            },
            {
                "value": 621061,
                "text": "甘肃省农村信用社"
            },
            {
                "value": 621449,
                "text": "辽宁省农村信用社"
            },
            {
                "value": 622968,
                "text": "山西省农村信用社联合社-关帝银行"
            },
            {
                "value": 621280,
                "text": "山西省农村信用社"
            },
            {
                "value": 621073,
                "text": "天津滨海农村商业银行"
            },
            {
                "value": 621228,
                "text": "黑龙江省农村信用社"
            },
            {
                "value": 621361,
                "text": "武汉农村商业银行"
            },
            {
                "value": 622891,
                "text": "江南农村商业银行"
            },
            {
                "value": 623510,
                "text": "海口联合农村商业银行"
            },
            {
                "value": 621056802,
                "text": "安吉交银村镇银行"
            },
            {
                "value": 621056801,
                "text": "大邑交银兴民村镇银行"
            },
            {
                "value": 621056803,
                "text": "石河子交银村镇银行"
            },
            {
                "value": 622995,
                "text": "湖北嘉鱼吴江村镇银行"
            },
            {
                "value": "6229756114",
                "text": "青岛即墨京都村镇银行"
            },
            {
                "value": "6229756115",
                "text": "湖北仙桃京都村镇银行"
            },
            {
                "value": 62105913,
                "text": "句容茅山村镇银行"
            },
            {
                "value": 62105916,
                "text": "兴化苏南村镇银行"
            },
            {
                "value": 62105915,
                "text": "海口苏南村镇银行"
            },
            {
                "value": 62105901,
                "text": "双流诚民村镇银行"
            },
            {
                "value": 62105900,
                "text": "宣汉诚民村镇银行"
            },
            {
                "value": 621053,
                "text": "福建建瓯石狮村镇银行"
            },
            {
                "value": 621260002,
                "text": "恩施常农商村镇银行"
            },
            {
                "value": 621260001,
                "text": "咸丰常农商村镇银行"
            },
            {
                "value": 621092003,
                "text": "浙江乐清联合村镇银行"
            },
            {
                "value": 621092002,
                "text": "浙江嘉善联合村镇银行"
            },
            {
                "value": 621092001,
                "text": "浙江长兴联合村镇银行"
            },
            {
                "value": 621092006,
                "text": "浙江义乌联合村镇银行"
            },
            {
                "value": 621092004,
                "text": "浙江常山联合村镇银行"
            },
            {
                "value": 621092005,
                "text": "浙江温岭联合村镇银行"
            },
            {
                "value": 621230,
                "text": "浙江平湖工银村镇银行"
            },
            {
                "value": 621229,
                "text": "重庆璧山工银村镇银行"
            },
            {
                "value": 621250004,
                "text": "北京密云汇丰村镇银行"
            },
            {
                "value": 621250003,
                "text": "福建永安汇丰村镇银行"
            },
            {
                "value": 621250001,
                "text": "湖北随州曾都汇丰村镇银行"
            },
            {
                "value": 621250005,
                "text": "广东恩平汇丰村镇银行"
            },
            {
                "value": 621250002,
                "text": "重庆大足汇丰村镇银行"
            },
            {
                "value": 621241001,
                "text": "江苏沭阳东吴村镇银行"
            },
            {
                "value": 621346003,
                "text": "鄂尔多斯市东胜蒙银村镇银行"
            },
            {
                "value": 621346002,
                "text": "方大村镇银行"
            },
            {
                "value": 621346001,
                "text": "深圳龙岗鼎业村镇银行"
            },
            {
                "value": 621326919,
                "text": "北京大兴九银村镇银行"
            },
            {
                "value": 621326763,
                "text": "中山小榄村镇银行"
            },
            {
                "value": 621338001,
                "text": "江苏邗江民泰村镇银行"
            },
            {
                "value": 621353008,
                "text": "天津静海新华村镇银行"
            },
            {
                "value": 621353002,
                "text": "安徽当涂新华村镇银行"
            },
            {
                "value": 621353005,
                "text": "安徽和县新华村镇银行"
            },
            {
                "value": 621353007,
                "text": "望江新华村镇银行"
            },
            {
                "value": 621353003,
                "text": "郎溪新华村镇银行"
            },
            {
                "value": 621353001,
                "text": "广州番禹新华村镇银行"
            },
            {
                "value": 621356014,
                "text": "宁波镇海中银富登村镇银行"
            },
            {
                "value": 621356013,
                "text": "宁海中银富登村镇银行"
            },
            {
                "value": 621356016,
                "text": "来安中银富登村镇银行"
            },
            {
                "value": 621356015,
                "text": "全椒中银富登村镇银行"
            },
            {
                "value": 621356005,
                "text": "青州中银富登村镇银行"
            },
            {
                "value": 621356018,
                "text": "嘉祥中银富登村镇银行"
            },
            {
                "value": 621356006,
                "text": "临邑中银富登村镇银行"
            },
            {
                "value": 621356004,
                "text": "沂水中银富登村镇银行"
            },
            {
                "value": 621356003,
                "text": "曹县中银富登村镇银行"
            },
            {
                "value": 621356017,
                "text": "单县中银富登村镇银行"
            },
            {
                "value": 621356007,
                "text": "谷城中银富登村镇银行"
            },
            {
                "value": 621356009,
                "text": "老河口中银富登村镇银行"
            },
            {
                "value": 621356008,
                "text": "枣阳中银富登村镇银行"
            },
            {
                "value": 621356002,
                "text": "京山中银富登村镇银行"
            },
            {
                "value": 621356001,
                "text": "蕲春中银富登村镇银行"
            },
            {
                "value": 621356010,
                "text": "潜江中银富登村镇银行"
            },
            {
                "value": 621356012,
                "text": "松滋中银富登村镇银行"
            },
            {
                "value": 621356011,
                "text": "监利中银富登村镇银行"
            },
            {
                "value": 621347002,
                "text": "北京顺义银座村镇银行"
            },
            {
                "value": 621347008,
                "text": "浙江景宁银座村镇银行"
            },
            {
                "value": 621347005,
                "text": "浙江三门银座村镇银行"
            },
            {
                "value": 621347003,
                "text": "江西赣州银座村镇银行"
            },
            {
                "value": 621347001,
                "text": "深圳福田银座村镇银行"
            },
            {
                "value": 621347006,
                "text": "重庆渝北银座村镇银行"
            },
            {
                "value": 621347007,
                "text": "重庆黔江银座村镇银行"
            },
            {
                "value": 621350010,
                "text": "北京怀柔融兴村镇银行"
            },
            {
                "value": 621350020,
                "text": "河间融惠村镇银行"
            },
            {
                "value": 621350431,
                "text": "榆树融兴村镇银行"
            },
            {
                "value": 621350451,
                "text": "巴彦融兴村镇银行"
            },
            {
                "value": 621350001,
                "text": "延寿融兴村镇银行"
            },
            {
                "value": 621350013,
                "text": "拜泉融兴村镇银行"
            },
            {
                "value": 621350005,
                "text": "桦川融兴村镇银行"
            },
            {
                "value": 621350009,
                "text": "江苏如东融兴村镇银行"
            },
            {
                "value": 621350003,
                "text": "安义融兴村镇银行"
            },
            {
                "value": 621350002,
                "text": "乐平融兴村镇银行"
            },
            {
                "value": 621350015,
                "text": "偃师融兴村镇银行"
            },
            {
                "value": 621350004,
                "text": "新安融兴村镇银行"
            },
            {
                "value": 621350006,
                "text": "应城融兴村镇银行"
            },
            {
                "value": 621350011,
                "text": "洪湖融兴村镇银行"
            },
            {
                "value": 621350016,
                "text": "株洲县融兴村镇银行"
            },
            {
                "value": 621350007,
                "text": "耒阳融兴村镇银行"
            },
            {
                "value": 621350755,
                "text": "深圳宝安融兴村镇银行"
            },
            {
                "value": 621350017,
                "text": "海南保亭融兴村镇银行"
            },
            {
                "value": 621350014,
                "text": "遂宁安居融兴村镇银行"
            },
            {
                "value": 621350019,
                "text": "重庆沙坪坝融兴村镇银行"
            },
            {
                "value": 621350012,
                "text": "重庆大渡口融兴村镇银行"
            },
            {
                "value": 621350008,
                "text": "重庆市武隆融兴村镇银行"
            },
            {
                "value": 621350018,
                "text": "重庆市酋阳融兴村镇银行"
            },
            {
                "value": 621350943,
                "text": "会宁会师村镇银行"
            },
            {
                "value": 621392,
                "text": "南阳村镇银行"
            },
            {
                "value": 621399017,
                "text": "宁晋民生村镇银行"
            },
            {
                "value": 621399008,
                "text": "梅河口民生村镇银行"
            },
            {
                "value": 621399001,
                "text": "上海松江民生村镇银行"
            },
            {
                "value": 621399012,
                "text": "嘉定民生村镇银行"
            },
            {
                "value": 621399025,
                "text": "天台民生村镇银行"
            },
            {
                "value": 621399026,
                "text": "天长民生村镇银行"
            },
            {
                "value": 621399023,
                "text": "宁国民生村镇银行"
            },
            {
                "value": 621399024,
                "text": "池州贵池民生村镇银行"
            },
            {
                "value": 621399002,
                "text": "安溪民生村镇银行"
            },
            {
                "value": 621399018,
                "text": "漳浦民生村镇银行"
            },
            {
                "value": 621399010,
                "text": "长垣民生村镇银行"
            },
            {
                "value": 621399009,
                "text": "江夏民生村镇银行"
            },
            {
                "value": 621399011,
                "text": "宜都民生村镇银行"
            },
            {
                "value": 621399013,
                "text": "钟祥民生村镇银行"
            },
            {
                "value": 621399005,
                "text": "綦江民生村镇银行"
            },
            {
                "value": 621399006,
                "text": "潼南民生村镇银行"
            },
            {
                "value": 621399021,
                "text": "普洱民生村镇银行"
            },
            {
                "value": 621399019,
                "text": "景洪民生村镇银行"
            },
            {
                "value": 621399027,
                "text": "腾冲民生村镇银行"
            },
            {
                "value": 621399020,
                "text": "志丹民生村镇银行"
            },
            {
                "value": 621399022,
                "text": "榆林榆阳民生村镇银行"
            },
            {
                "value": 621365006,
                "text": "浙江萧山湖商村镇银行"
            },
            {
                "value": 621365001,
                "text": "浙江建德湖商村镇银行"
            },
            {
                "value": 621365005,
                "text": "浙江德清湖商村镇银行"
            },
            {
                "value": 621365004,
                "text": "安徽粤西湖商村镇银行"
            },
            {
                "value": 621365003,
                "text": "安徽蒙城湖商村镇银行"
            },
            {
                "value": 621365002,
                "text": "安徽利辛湖商村镇银行"
            },
            {
                "value": 621481,
                "text": "晋中市榆次融信村镇银行"
            },
            {
                "value": 621393001,
                "text": "梅县客家村镇银行"
            },
            {
                "value": 621623001,
                "text": "宝生村镇银行"
            },
            {
                "value": 621397001,
                "text": "江苏大丰江南村镇银行"
            },
            {
                "value": 621627001,
                "text": "吉安稠州村镇银行"
            },
            {
                "value": 621627007,
                "text": "广州花都稠州村镇银行"
            },
            {
                "value": 621627003,
                "text": "重庆北碚稠州村镇银行"
            },
            {
                "value": 621627006,
                "text": "忠县稠州村镇银行"
            },
            {
                "value": 621627010,
                "text": "云南安宁稠州村镇银行"
            },
            {
                "value": 621635101,
                "text": "象山国民村镇银行"
            },
            {
                "value": 621635114,
                "text": "宁波市鄞州国民村镇银行"
            },
            {
                "value": 621635003,
                "text": "南宁江南国民村镇银行"
            },
            {
                "value": 621635004,
                "text": "桂林国民村镇银行"
            },
            {
                "value": 621635112,
                "text": "银海国民村镇银行"
            },
            {
                "value": 621635111,
                "text": "平果国民村镇银行"
            },
            {
                "value": 621635013,
                "text": "钦州市钦南国民村镇银行"
            },
            {
                "value": 621635010,
                "text": "防城港防城国民村镇银行"
            },
            {
                "value": 621635005,
                "text": "东兴国民村镇银行"
            },
            {
                "value": 621635106,
                "text": "石河子国民村镇银行"
            },
            {
                "value": 621650002,
                "text": "文昌国民村镇银行"
            },
            {
                "value": 621650001,
                "text": "琼海国民村镇银行"
            },
            {
                "value": 62163113,
                "text": "北京门头沟珠江村镇银行"
            },
            {
                "value": 62163103,
                "text": "大连保税区珠江村镇银行"
            },
            {
                "value": 62163119,
                "text": "启东珠江村镇银行"
            },
            {
                "value": 62163120,
                "text": "盱眙珠江村镇银行"
            },
            {
                "value": 62163117,
                "text": "青岛城阳珠江村镇银行"
            },
            {
                "value": 62163115,
                "text": "莱州珠江村镇银行"
            },
            {
                "value": 62163104,
                "text": "莱芜珠江村镇银行"
            },
            {
                "value": 62163118,
                "text": "安阳珠江村镇银行"
            },
            {
                "value": 62163108,
                "text": "辉县珠江村镇银行"
            },
            {
                "value": 62163107,
                "text": "信阳珠江村镇银行"
            },
            {
                "value": 621310,
                "text": "三水珠江村镇银行"
            },
            {
                "value": 62163101,
                "text": "鹤山珠江村镇银行"
            },
            {
                "value": 62163102,
                "text": "中山东凤珠江村镇银行"
            },
            {
                "value": 62163109,
                "text": "新津珠江村镇银行"
            },
            {
                "value": 62163110,
                "text": "广汉珠江村镇银行"
            },
            {
                "value": 62163111,
                "text": "彭山珠江村镇银行"
            },
            {
                "value": 621653002,
                "text": "安徽肥西石银村镇银行"
            },
            {
                "value": 621653004,
                "text": "重庆南川石银村镇银行"
            },
            {
                "value": 621653005,
                "text": "重庆江津石银村镇银行"
            },
            {
                "value": 621653007,
                "text": "银川掌政石银村镇银行"
            },
            {
                "value": 621653006,
                "text": "大武口石银村镇银行"
            },
            {
                "value": 621653001,
                "text": "吴忠市滨河村镇银行"
            },
            {
                "value": 62308299,
                "text": "广元贵商村镇银行"
            },
            {
                "value": 621628660,
                "text": "佛山高明顺银村镇银行"
            },
            {
                "value": 621316001,
                "text": "青岛胶南海汇村镇银行"
            },
            {
                "value": 62319801,
                "text": "惠州仲恺东盈村镇银行"
            },
            {
                "value": 62319806,
                "text": "东莞大朗东盈村镇银行"
            },
            {
                "value": 62319802,
                "text": "云浮新兴东盈民生村镇银行"
            },
            {
                "value": 62319803,
                "text": "贺州八步东盈村镇银行"
            },
            {
                "value": 621355002,
                "text": "宜兴阳羡村镇银行"
            },
            {
                "value": 621355001,
                "text": "昆山鹿城村镇银行"
            },
            {
                "value": 621396,
                "text": "东营莱商村镇银行"
            },
            {
                "value": 621656001,
                "text": "河南方城凤裕村镇银行"
            },
            {
                "value": 621659001,
                "text": "永清吉银村镇银行"
            },
            {
                "value": 621659006,
                "text": "长春双阳吉银村镇银行"
            },
            {
                "value": 621398001,
                "text": "江都吉银村镇银行"
            },
            {
                "value": 621676001,
                "text": "湖北咸安武农商村镇银行"
            },
            {
                "value": 621676002,
                "text": "湖北赤壁武弄商村镇银行"
            },
            {
                "value": 621676003,
                "text": "广州增城长江村镇银行"
            },
            {
                "value": 621680002,
                "text": "张家港渝农商村镇银行"
            },
            {
                "value": 621680009,
                "text": "福建沙县渝农商村镇银行"
            },
            {
                "value": 621680005,
                "text": "广西鹿寨渝农商村镇银行"
            },
            {
                "value": 621680004,
                "text": "云南大理渝农商村镇银行"
            },
            {
                "value": 621680006,
                "text": "云南祥云渝农商村镇银行"
            },
            {
                "value": 621680008,
                "text": "云南鹤庆渝农商村镇银行"
            },
            {
                "value": 621680011,
                "text": "云南香格里拉渝农商村镇银行"
            },
            {
                "value": 621681001,
                "text": "沈阳于洪永安村镇银行"
            },
            {
                "value": 621682002,
                "text": "北京房山沪农商村镇银行"
            },
            {
                "value": 621682101,
                "text": "济南长清沪农商村镇银行"
            },
            {
                "value": 621682102,
                "text": "济南槐荫沪农商村镇银行"
            },
            {
                "value": 621682106,
                "text": "泰安沪农商村镇银行"
            },
            {
                "value": 621682103,
                "text": "宁阳沪农商村镇银行"
            },
            {
                "value": 621682105,
                "text": "东平沪农商村镇银行"
            },
            {
                "value": 621682110,
                "text": "聊城沪农商村镇银行"
            },
            {
                "value": 621682111,
                "text": "临清沪农商村镇银行"
            },
            {
                "value": 621682109,
                "text": "阳谷沪农商村镇银行"
            },
            {
                "value": 621682108,
                "text": "茌平沪农商村镇银行"
            },
            {
                "value": 621682107,
                "text": "日照沪农商村镇银行"
            },
            {
                "value": 621682202,
                "text": "长沙星沙沪农商村镇银行"
            },
            {
                "value": 621682201,
                "text": "宁乡沪农商行村镇银行"
            },
            {
                "value": 621682203,
                "text": "醴陵沪农商村镇银行"
            },
            {
                "value": 621682205,
                "text": "衡阳沪农商村镇银行"
            },
            {
                "value": 621682209,
                "text": "澧县沪农商村镇银行"
            },
            {
                "value": 621682208,
                "text": "临澧沪农商村镇银行"
            },
            {
                "value": 621682210,
                "text": "石门沪农商村镇银行"
            },
            {
                "value": 621682213,
                "text": "慈利沪农商村镇银行"
            },
            {
                "value": 621682211,
                "text": "涟源沪农商村镇银行"
            },
            {
                "value": 621682212,
                "text": "双峰沪农商村镇银行"
            },
            {
                "value": 621682207,
                "text": "桂阳沪农商村镇银行"
            },
            {
                "value": 621682206,
                "text": "永兴沪农商村镇银行"
            },
            {
                "value": 621682003,
                "text": "深圳光明沪农商村镇银行"
            },
            {
                "value": 621682301,
                "text": "阿拉沪农商村镇银行"
            },
            {
                "value": 621682302,
                "text": "嵩明沪农商村镇银行"
            },
            {
                "value": 621682305,
                "text": "个旧沪农商村镇银行"
            },
            {
                "value": 621682307,
                "text": "开远沪农商村镇银行"
            },
            {
                "value": 621682306,
                "text": "蒙自沪农商村镇银行"
            },
            {
                "value": 621682309,
                "text": "建水沪农商村镇银行"
            },
            {
                "value": 621682308,
                "text": "弥勒沪农商村镇银行"
            },
            {
                "value": 621682310,
                "text": "保山隆阳沪农商村镇银行"
            },
            {
                "value": 621682303,
                "text": "瑞丽沪农商村镇银行"
            },
            {
                "value": 621682311,
                "text": "临沧临翔沪农商村镇银行"
            },
            {
                "value": 621687913,
                "text": "宝丰豫丰村镇银行"
            },
            {
                "value": 62169501,
                "text": "新密郑银村镇银行"
            },
            {
                "value": 62169503,
                "text": "鄢陵郑银村镇银行"
            },
            {
                "value": 62352801,
                "text": "安徽五河永泰村镇银行"
            },
            {
                "value": 621697813,
                "text": "天津华明村镇银行"
            },
            {
                "value": 621697793,
                "text": "任丘泰寿村镇银行"
            },
            {
                "value": 621697873,
                "text": "芜湖泰寿村镇银行"
            },
            {
                "value": 62311701,
                "text": "长葛轩辕村镇银行"
            },
            {
                "value": 621689004,
                "text": "北流柳银村镇银行"
            },
            {
                "value": 621689005,
                "text": "陆川柳银村镇银行"
            },
            {
                "value": 621689006,
                "text": "博白柳银村镇银行"
            },
            {
                "value": 621689003,
                "text": "兴业柳银村镇银行"
            },
            {
                "value": 621387973,
                "text": "浙江兰溪越商村镇银行"
            },
            {
                "value": 621382019,
                "text": "北京昌平兆丰村镇银行"
            },
            {
                "value": 621382018,
                "text": "天津津南村镇银行"
            },
            {
                "value": 621382020,
                "text": "清徐惠民村镇银行"
            },
            {
                "value": 621382001,
                "text": "固阳包商惠农村镇银行"
            },
            {
                "value": 621382002,
                "text": "宁城包商村镇银行"
            },
            {
                "value": 621382010,
                "text": "科尔沁包商村镇银行"
            },
            {
                "value": 621382007,
                "text": "集宁包商村镇银行"
            },
            {
                "value": 621382003,
                "text": "准格尔旗包商村镇银行"
            },
            {
                "value": 621382004,
                "text": "乌审旗包商村镇银行"
            },
            {
                "value": 621382025,
                "text": "大连金州联丰村镇银行"
            },
            {
                "value": 621382013,
                "text": "九台龙嘉村镇银行"
            },
            {
                "value": 621382017,
                "text": "江苏南通如皋包商村镇银行"
            },
            {
                "value": 621382021,
                "text": "仪征包商村镇银行"
            },
            {
                "value": 621382023,
                "text": "鄄城包商村镇银行"
            },
            {
                "value": 621382015,
                "text": "漯河市郾城包商村镇银行"
            },
            {
                "value": 621382016,
                "text": "掇刀包商村镇银行"
            },
            {
                "value": 621382014,
                "text": "新都桂城村镇银行"
            },
            {
                "value": 621382024,
                "text": "广元包商贵民村镇银行"
            },
            {
                "value": 621382011,
                "text": "息烽包商黔隆村镇银行"
            },
            {
                "value": 621382022,
                "text": "毕节发展村镇银行"
            },
            {
                "value": 621382026,
                "text": "宁夏贺兰回商村镇银行"
            },
            {
                "value": 621383001,
                "text": "辽宁大石桥隆丰村镇银行"
            },
            {
                "value": 621278333,
                "text": "通城惠民村镇银行"
            },
            {
                "value": 621386001,
                "text": "武陟射阳村镇银行"
            },
            {
                "value": 623678353,
                "text": "山东临朐聚丰村镇银行"
            },
            {
                "value": 623608001,
                "text": "德庆华润村镇银行"
            },
            {
                "value": 623608002,
                "text": "百色右江华润村镇银行"
            },
            {
                "value": 62351501,
                "text": "江苏丹阳保得村镇银行"
            },
            {
                "value": 62168301,
                "text": "江苏丰县民丰村镇银行"
            },
            {
                "value": 62168302,
                "text": "江苏灌南民丰村镇银行"
            },
            {
                "value": 621034,
                "text": "上海商业银行"
            },
            {
                "value": 622971,
                "text": "永隆银行"
            },
            {
                "value": 622406,
                "text": "香港上海汇丰银行"
            },
            {
                "value": 622459,
                "text": "中信嘉华银行"
            },
            {
                "value": 622272,
                "text": "创兴银行"
            },
            {
                "value": 621742,
                "text": "集友银行"
            },
            {
                "value": 622547,
                "text": "大丰银行"
            },
            {
                "value": 622861,
                "text": "澳门永亨银行"
            },
            {
                "value": 622434,
                "text": "澳门国际银行"
            },
            {
                "value": 621232,
                "text": "大西洋银行"
            },
            {
                "value": 621253,
                "text": "澳门商业银行"
            },
            {
                "value": 622549,
                "text": "哈萨克斯坦国民储蓄银行"
            },
            {
                "value": 621224,
                "text": "可汗银行"
            },
            {
                "value": 621049,
                "text": "蒙古郭勒姆特银行"
            },
            {
                "value": 621040,
                "text": "莫斯科人民储蓄银行"
            },
            {
                "value": 621045,
                "text": "丝绸之路银行"
            },
            {
                "value": 621264,
                "text": "俄罗斯远东商业银行"
            },
            {
                "value": 621055,
                "text": "越南西贡商业银行"
            },
            {
                "value": 623001,
                "text": "广西北部湾银行"
            },
            {
                "value": 621456,
                "text": "桂林银行"
            },
            {
                "value": 621416,
                "text": "上饶银行"
            },
            {
                "value": 623092,
                "text": "江西省农村信用社"
            },
            {
                "value": 621748,
                "text": "商丘市商业银行"
            },
            {
                "value": 621635109,
                "text": "合浦国民村镇银行"
            },
            {
                "value": 621635108,
                "text": "昌吉国民村镇银行"
            },
            {
                "value": 62163121,
                "text": "常宁珠江村镇银行"
            },
            {
                "value": 62316904,
                "text": "枞阳泰业村镇银行"
            },
            {
                "value": 62316905,
                "text": "东源泰业村镇银行"
            },
            {
                "value": 62316902,
                "text": "东莞长安村镇银行"
            },
            {
                "value": 62316903,
                "text": "灵山泰业村镇银行"
            },
            {
                "value": 62316901,
                "text": "开县泰业村镇银行"
            },
            {
                "value": 62316906,
                "text": "东莞厚街华业村镇银行"
            },
            {
                "value": 62361026,
                "text": "西安高陵阳光村镇银行"
            },
            {
                "value": 62361025,
                "text": "陕西洛南阳光村镇银行"
            },
            {
                "value": 62168305,
                "text": "江苏溧水民丰村镇银行"
            }
        ]
    },
    {
        "value": "credit_card",
        "text": "信用卡",
        "children": [
            {
                "value": 427018,
                "text": "中国工商银行"
            },
            {
                "value": 6349102,
                "text": "农业银行"
            },
            {
                "value": 409668,
                "text": "中国银行"
            },
            {
                "value": 5453242,
                "text": "建设银行"
            },
            {
                "value": 489592,
                "text": "中国建设银行"
            },
            {
                "value": "0049104",
                "text": "交通银行"
            },
            {
                "value": 356837,
                "text": "光大银行"
            },
            {
                "value": 356859,
                "text": "民生银行"
            },
            {
                "value": 406365,
                "text": "广发银行"
            },
            {
                "value": 356885,
                "text": "招商银行"
            },
            {
                "value": 486861,
                "text": "兴业银行"
            },
            {
                "value": 404738,
                "text": "浦东发展银行"
            },
            {
                "value": 356830,
                "text": "上海银行"
            },
            {
                "value": 622178,
                "text": "吉林银行"
            },
            {
                "value": 628242,
                "text": "南京银行"
            },
            {
                "value": 622397,
                "text": "宜昌市商业银行"
            },
            {
                "value": 622868,
                "text": "温州银行"
            },
            {
                "value": 531659,
                "text": "平安银行"
            },
            {
                "value": 628210,
                "text": "江苏银行"
            },
            {
                "value": 625288,
                "text": "东莞农村商业银行"
            },
            {
                "value": 622471,
                "text": "东亚银行"
            },
            {
                "value": 622371,
                "text": "花旗银行"
            },
            {
                "value": 622293,
                "text": "大新银行"
            },
            {
                "value": 622386,
                "text": "上海商业银行"
            },
            {
                "value": 622387,
                "text": "永隆银行"
            },
            {
                "value": 622376,
                "text": "恒生银行"
            },
            {
                "value": 622453,
                "text": "中信嘉华银行"
            },
            {
                "value": 625008,
                "text": "创兴银行"
            },
            {
                "value": 625046,
                "text": "南洋商业银行"
            },
            {
                "value": 625048,
                "text": "集友银行"
            },
            {
                "value": 622482,
                "text": "渣打银行"
            },
            {
                "value": 622812,
                "text": "中国邮政储蓄银行"
            },
            {
                "value": 376968,
                "text": "中信银行"
            },
            {
                "value": 356839,
                "text": "中国光大银行"
            },
            {
                "value": 523959,
                "text": "华夏银行"
            },
            {
                "value": 625971,
                "text": "浦发银行"
            },
            {
                "value": 625050,
                "text": "广州银行"
            },
            {
                "value": 625800,
                "text": "杭州市商业银行"
            },
            {
                "value": 628270,
                "text": "珠海华润银行"
            },
            {
                "value": 622287,
                "text": "浙江泰隆商业银行"
            },
            {
                "value": 625080,
                "text": "广州农村商业银行"
            },
            {
                "value": 622829,
                "text": "天津农村商业银行"
            }
        ]
    }
]